---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitRating
source: html/68c26af5-18b0-0a5f-5250-9a63c190c1eb.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitRating Property

The default circuit rating for newly created circuit.

## Syntax (C#)
```csharp
public double CircuitRating { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The circuit rating should be non-negative.